tests/Api/Results/setupsubscription_fail.xml

<?xml version="1.0"?>
<APIResponse version="20151228">
    <Header>
        <Date>2016-06-01T07:59:55+02:00</Date>
        <Path>API/setupSubscription/</Path>
        <ErrorCode>0</ErrorCode>
        <ErrorMessage/>
    </Header>
    <Body>
        <Result>Failed</Result>
        <MerchantErrorMessage>TestAcquirer[pan=1466 or amount=14660]</MerchantErrorMessage>
        <CardHolderErrorMessage>Card Declined</CardHolderErrorMessage>
        <CardHolderMessageMustBeShown>false</CardHolderMessageMustBeShown>
        <Transactions>
            <Transaction>
                <TransactionId>10205361</TransactionId>
                <PaymentId>ef70675b-38c2-4d4a-b496-d45a9d98437c</PaymentId>
                <AuthType>subscription</AuthType>
                <CardStatus>InvalidLuhn</CardStatus>
                <CreditCardExpiry>
                    <Year>2017</Year>
                    <Month>06</Month>
                </CreditCardExpiry>
                <CreditCardToken>96b5b12bfce19b7e19b0da20a67a3dbac17248bb</CreditCardToken>
                <CreditCardMaskedPan>414000******1466</CreditCardMaskedPan>
                <ThreeDSecureResult>Not_Attempted</ThreeDSecureResult>
                <LiableForChargeback>Merchant</LiableForChargeback>
                <CVVCheckResult>Not_Attempted</CVVCheckResult>
                <BlacklistToken>6784612fc7abd7c4986e490d98cb0989e96fa630</BlacklistToken>
                <ShopOrderId>1464760793</ShopOrderId>
                <Shop>shop</Shop>
                <Terminal>terminal</Terminal>
                <TransactionStatus>recurring_failed</TransactionStatus>
                <ReasonCode>NONE</ReasonCode>
                <MerchantCurrency>208</MerchantCurrency>
                <MerchantCurrencyAlpha>DKK</MerchantCurrencyAlpha>
                <CardHolderCurrency>208</CardHolderCurrency>
                <CardHolderCurrencyAlpha>DKK</CardHolderCurrencyAlpha>
                <ReservedAmount>0.00</ReservedAmount>
                <CapturedAmount>0.00</CapturedAmount>
                <RefundedAmount>0.00</RefundedAmount>
                <CreditedAmount>0.00</CreditedAmount>
                <RecurringDefaultAmount>0.00</RecurringDefaultAmount>
                <SurchargeAmount>0.00</SurchargeAmount>
                <CreatedDate>2016-06-01 07:59:54</CreatedDate>
                <UpdatedDate>2016-06-01 07:59:54</UpdatedDate>
                <PaymentNature>CreditCard</PaymentNature>
                <PaymentSchemeName>Visa</PaymentSchemeName>
                <PaymentNatureService name="SoapTestAcquirer">
                    <SupportsRefunds>true</SupportsRefunds>
                    <SupportsRelease>true</SupportsRelease>
                    <SupportsMultipleCaptures>true</SupportsMultipleCaptures>
                    <SupportsMultipleRefunds>true</SupportsMultipleRefunds>
                </PaymentNatureService>
                <ChargebackEvents/>
                <PaymentInfos/>
                <CustomerInfo>
                    <UserAgent>agent</UserAgent>
                    <IpAddress>125.125.125.125</IpAddress>
                    <Email/>
                    <Username/>
                    <CustomerPhone/>
                    <OrganisationNumber/>
                    <CountryOfOrigin>
                        <Country/>
                        <Source>NotSet</Source>
                    </CountryOfOrigin>
                    <BillingAddress>
                        <Firstname/>
                        <Lastname/>
                        <Address/>
                        <City/>
                        <Region/>
                        <Country/>
                        <PostalCode/>
                    </BillingAddress>
                    <ShippingAddress>
                        <Firstname/>
                        <Lastname/>
                        <Address/>
                        <City/>
                        <Region/>
                        <Country/>
                        <PostalCode/>
                    </ShippingAddress>
                </CustomerInfo>
                <ReconciliationIdentifiers/>
            </Transaction>
        </Transactions>
    </Body>
</APIResponse>
